Documents/Coding/MusicApp/harmonia/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "FierySwagger"], ["LIMIT", 1]]
---
  def self.find_by_credentials(uname, pword)
    # user = User.find_by(username: username)
    # user && user.is_password?(password) ? user : nil
    #This syntax MUST become muscle memory
    user = User.find_by(username: uname)

UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "v5bEz5fnEkejxOMhUOGydA"], ["id", 2]]
---
  def reset_session_token!
    #assign, save, return.
    #assign, save , return
    self.session_token = SecureRandom.urlsafe_base64
    self.save!