Documents/Coding/MusicApp/harmonia/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "session_token") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "Megashred"], ["email", "megashred@email.com"], ["password_digest", "$2a$10$myBfvxGaxPlwc.YxkmMD..m1cuPJt.XoW2mfjEXe2iaO2QUmibsSS"], ["session_token", "fi1m1f6EfT21RUcDiWBGtg"]]
---
  def create
    @user = User.new(user_params)
    if @user.save